src/InformationRegisters/ОбменСНСИ/ОбменСНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбменСНСИ</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбменаСНСИ</types>
    </type>
  </resources>
  <resources>
    <name>КодОСК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОбменСНСИ/ManagerModule.bsl
///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ДобавитьЗапись(Объект, Идентификатор, Состояние, КодОСК = "") Экспорт
	Запись 						= РегистрыСведений.ОбменСНСИ.СоздатьМенеджерЗаписи();
	Запись.Объект 				= Объект; 	
	Запись.Идентификатор 		= Идентификатор;
	Запись.Состояние 			= Состояние;
	Запись.КодОСК				= КодОСК;
	Запись.Записать();
КонецПроцедуры // ДобавитьЗапись
